export const usePersianMonths = () => {
  return [
    {
      title: 'فروردین',
      start: '1403/01/01',
      end: '1403/01/31',
    },
    {
      title: 'اردیبهشت',
      start: '1403/02/01',
      end: '1403/02/31',
    },
    {
      title: 'خرداد',
      start: '1403/03/01',
      end: '1403/03/31',
    },
    {
      title: 'تیر',
      start: '1403/04/01',
      end: '1403/04/31',
    },
    {
      title: 'مرداد',
      start: '1403/05/01',
      end: '1403/05/31',
    },
    {
      title: 'شهریور',
      start: '1403/06/01',
      end: '1403/06/31',
    },
    {
      title: 'مهر',
      start: '1403/07/01',
      end: '1403/07/30',
    },
    {
      title: 'آبان',
      start: '1403/08/01',
      end: '1403/08/30',
    },
    {
      title: 'آذر',
      start: '1403/09/01',
      end: '1403/09/30',
    },
    {
      title: 'دی',
      start: '1403/10/01',
      end: '1403/10/30',
    },
    {
      title: 'بهمن',
      start: '1403/11/01',
      end: '1403/11/30',
    },
    {
      title: 'اسفند',
      start: '1403/12/01',
      end: '1403/12/29',
    },
  ]
}
